public interface CharOperations {

    public void add(char c) throws FullSizeException ;
    /*
    Προσθήκη ενός χαρακτήρα στο τέλος της ακολουθίας. 
    Σε περίπτωση που με την προσθήκη του νέου χαρακτήρα 
    το συνολικό πλήθος των χαρακτήρων της ακολουθίας είναι
    μεγαλύτερο από το μέγεθος του πίνακα εγείρεται η εξαίρεση
    FullSizeException και δεν θα πραγματοποιείται η εισαγωγή.
    */

    public void add(String str) throws FullSizeException;
    
    /*
    Προσθήκη των χαρακτήρων του αλφαριθμητικού στο τέλος της ακολουθίας. 
    Σε περίπτωση που με την προσθήκη των χαρακτήρων της νέας συμβολοσειράς
    το συνολικό πλήθος των χαρακτήρων της ακολουθίας είναι μεγαλύτερο από το
    μέγεθος του πίνακα (και δεν μπορεί να προσαρτηθεί ολόκληρο το αλφαριθμητικό)
    θα εγείρεται η εξαίρεση FullSizeException.
    */

    public int size();
    //Επιστρέφει το πλήθος των χαρακτήρων της ακολουθίας
    
    public boolean isEmpty();
    //Έλεγχος εάν είναι κενή η ακολουθία
    
    public void print();
    //Εμφάνιση της ακολουθίας    
    
    public void printReverse();
    //Εμφάνιση της ακολουθίας με αντίστροφη σειρά
   
}